import React from 'react';
import { View, Text, StyleSheet, ScrollView } from 'react-native';
import PositionText from '../../components/analysisScreen/playerScreen/PositionText';
import PlayerInfo from '../../components/analysisScreen/playerScreen/PlayerInfo';

const PlayerScreen = () => {
  const statInfo = [["포지션", "득점","도움", "공격포인트", "슈팅","파울", "경고", "퇴장","패널티킥", "유효 슈팅", "경기수"],
  ["김정훈","GK","0","0","0","0","0","0","0","0","0","0"],
  ["정민기","GK","0","0","0","0","0","0","0","0","0","0"],
  ["김진수","DF","0","0","0","0","0","0","0","0","0","0"],
  ["정우재","DF","0","0","0","0","0","0","0","0","0","0"],
  ["박진섭","DF","0","0","0","0","0","0","0","0","0","0"],
  ["윤영선","DF","0","0","0","0","0","0","0","0","0","0"],
  ["구자룡","DF","0","0","0","0","0","0","0","0","0","0"],
  ["페트라섹","DF","0","0","0","0","0","0","0","0","0","0"],
  ["정태욱","DF","0","0","0","0","0","0","0","0","0","0"],
  ["홍정호","DF","0","0","0","0","0","0","0","0","0","0"],
  ["최철순","DF","0","0","0","0","0","0","0","0","0","0"],
  ["박창우","DF","0","0","0","0","0","0","0","0","0","0"],
  ["안현범","DF","0","0","0","0","0","0","0","0","0","0"],
  ["이수빈","MF","0","0","0","0","0","0","0","0","0","0"],
  ["류재문","MF","0","0","0","0","0","0","0","0","0","0"],
  ["보아텡","MF","0","0","0","0","0","0","0","0","0","0"],
  ["백승호","MF","0","0","0","0","0","0","0","0","0","0"],
  ["맹성웅","MF","0","0","0","0","0","0","0","0","0","0"],
  ["오재혁","MF","0","0","0","0","0","0","0","0","0","0"],
  ["아마노","MF","0","0","0","0","0","0","0","0","0","0"],
  ["안드레 루이스","MF","0","0","0","0","0","0","0","0","0","0"],
  ["송민규","ATK","0","0","0","0","0","0","0","0","0","0"],
  ["문선민","ATK","0","0","0","0","0","0","0","0","0","0"],
  ["한교원","ATK","0","0","0","0","0","0","0","0","0","0"],
  ["이동준","ATK","0","0","0","0","0","0","0","0","0","0"],
  ["구스타보","ATK","0","0","0","0","0","0","0","0","0","0"],
  ["박재용","ATK","0","0","0","0","0","0","0","0","0","0"],
  ["하파엘 실바","ATK","0","0","0","0","0","0","0","0","0","0"],];

  const playerName = [["김정훈","정민기","김진수","정우재","박진섭","윤영선","구자룡",
  "페트라섹","정태욱","홍정호","최철순","박창우","안현범","이수빈","류재문","보아텡",
  "백승호","맹성웅","오재혁","아마노","안드레 루이스","송민규","문선민","한교원","이동준",
  "구스타보","박재용","하파엘 실바"]];

  return (
  <ScrollView vertical={true}>
    <View style={{ flexDirection: "column" }}>
      <PlayerInfo statInfo={statInfo} />
    </View>
  </ScrollView>
  );
};

export default PlayerScreen;

/*
   <View style={{flexDirection:"row", marginTop:"10"}}>
<ScrollView style={{flexDirection:"row"}}>
		      <StatsInfo></StatsInfo>
        </ScrollView>*/